{
  "type": "band",
  "name": "Metallica",
  "yearsActive": "1981-xxxx",
  "originCountry": "USA",
  "members": [
    "James Hetfield",
    "Kirk Hammett",
    "Lars Ulrich",
    "Robert Trujillo"
  ],
  "pastMembers": [
    "Cliff Burton"
    "Dave Mustaine",
    "Jason Newsted",
    "Ron McGovney"
  ],
  "genres": [
    "Hard Rock",
    "Heavy Metal",
    "Speed Metal",
    "Thrash Metal"
  ],
  "labels": [
    "Blackened Records",
    "Elektra Records",
    "Megaforce Records",
    "Vertigo Records",
    "Warner Bros. Records"
  ],
  "bio": "Metallica is an American heavy metal band. The band was formed in 1981 in Los Angeles by vocalist/guitarist James Hetfield and drummer Lars Ulrich, and has been based in San Francisco for most of its career. The band's fast tempos, instrumentals and aggressive musicianship made them one of the founding \"big four\" bands of thrash metal, alongside Megadeth, Anthrax and Slayer. Metallica's current lineup comprises founding members and primary songwriters Hetfield and Ulrich, longtime lead guitarist Kirk Hammett, and bassist Robert Trujillo. Guitarist Dave Mustaine (who went on to form Megadeth after being fired from the band) and bassists Ron McGovney, Cliff Burton (who died in a bus accident in Sweden in 1986) and Jason Newsted are former members of the band.\n\nMetallica earned a growing fan base in the underground music community and won critical acclaim with its first five albums. The band's third album, Master of Puppets (1986), was described as one of the heaviest and most influential thrash metal albums. Its eponymous fifth album, Metallica (1991), the band's first to root predominantly in heavy metal, appealed to a more mainstream audience, achieving substantial commercial success and selling over 16 million copies in the United States to date, making it the best-selling album of the SoundScan era. After experimenting with different genres and directions in subsequent releases, the band returned to its thrash metal roots with the release of its ninth album, Death Magnetic (2008), which drew similar praise to that of the band's earlier albums.\n\nIn 2000, Metallica led the case against the peer-to-peer file sharing service Napster, in which the band and several other artists filed lawsuits against the service for sharing their copyright-protected material without consent; after reaching a settlement, Napster became a pay-to-use service in 2003. Metallica was the subject of the acclaimed 2004 documentary film Metallica: Some Kind of Monster, which documented the troubled production of the band's eighth album, St. Anger (2003), and the internal struggles within the band at the time. In 2009, Metallica was inducted into the Rock and Roll Hall of Fame. The band wrote the screenplay for and starred in the 2013 IMAX concert film Metallica: Through the Never, in which the band performed live against a fictional thriller storyline.\n\nMetallica has released ten studio albums, four live albums, a cover album, five extended plays, 37 singles and 39 music videos. The band has won nine Grammy Awards from 23 nominations, and its last six studio albums (beginning with Metallica) have consecutively debuted at number one on the Billboard 200. Metallica ranks as one of the most commercially successful bands of all time, having sold over 125 million albums worldwide as of 2018. Metallica has been listed as one of the greatest artists of all time by magazines such as Rolling Stone, which ranked them at no. 61 on its 100 Greatest Artists of All Time list. As of 2017, Metallica is the third best-selling music artist since Nielsen SoundScan began tracking sales in 1991, selling a total of 58 million albums in the United States.",
  "links": [{
    "type": "wikipedia",
    "url": "https://en.wikipedia.org/wiki/Metallica"
  }, {
    "type": "discogs",
    "url": "https://www.discogs.com/artist/18839-Metallica"
  }, {
    "type": "lastfm",
    "url": "https://www.last.fm/music/Metallica"
  }],
  "testimony": {
    "from": "Flea",
    "text": "In 1984, I was on tour with my band, somewhere in the middle of America. It was around 3:00 or 4:00 in the morning. We're all crammed into our van, with all our equipment. It was raining. We were tired, we'd been on the road. And this music comes on the radio. I couldn't believe that it existed. My mind was being blown by this beautiful violence that was unlike anything I'd ever heard before.\n\nIt wasn't punk rock. It wasn't heavy metal. It was precise and explosive and heavy. It was aggressive and intense, and it had these really wild and bizarre rhythm changes. But it still held together as a bitchin'-ass song. I was singin' along with it by the end, though it certainly wasn't using any conventional pop-song pattern that I had ever heard. That song was \"Fight Fire With Fire.\" And it opened up my mind to the mighty force of nature that is Metallica.\n\nWhen Metallica started in 1981, they didn't really take your typical path to success. I don't know if massive stardom and selling a zillion records were on their minds when they were getting the ball rolling. But if they were aiming at becoming one of the most successful rock bands of all time, they sure were going about it in a kooky way. Maybe they were thinking they were going to break into Casey Kasem's Top 40 countdown with their debut record, Kill 'Em All. They were definitely going for a hit single with the song \"(Anesthesia) Pulling Teeth.\" A five-minute-long bass solo is a sure ticket to commercial success.\n\nThat song is one of the great moments in rock history for the electric bass guitar. Every Cliff Burton-based solo I've ever heard is a soulful, psychedelic, headbanging expression that rocks your world, trips your brain out and gets the house rockin'. It's a beautiful piece of music played by an awesome rocker of a young man who was a masterpiece of a human being. I can never listen to any Metallica record without thinking of him. It is clear that the gift he gave lives on in that band's music.\n\nThe fact that Metallica connected with the world in the way that they have is phenomenal. They have become a household name with music that is anything but mainstream. It's outsider music. And for it to do what it has done is truly mind-blowing. When I hear Metallica, I get this feeling that they're doing something that they have to do.\n\nThere is this thing in them wound up so tight that they have to let it out, let that thing uncoil; it has to be released. An infinite well of sadness, a hell of a lot of pain and anger, but mostly, a lot of love for the process of releasing this stuff. For the people who give it up and get rocked by Metallica, the world is a less lonely place. When a person gets rocking to their music, everything else disappears, and that person is just one with the rock. It is an inexplicable, awesome thing, and I bow down to it. Pain and hurt can be a muse for great art. It's one of the greatest rites of passage for any artist, and it's something that touches us most deeply. Anyone who has ever been to a Metallica show, and banged their head, and thrown up the devil horns, has been a part of something great. Rocking so hard to the brutal beat of Metallica for those couple of hours, in a way, is as healthy as any spiritual exercise — group meditation, any love-in, anything.\n\nMetallica's career is a huge, dynamic thing, and they have done it all. They have worked their way up from nothing, and written the jams that rocked the world. Metallica are fucking rad! The music is bitchin'! It is unbelievable! And they continue to rock on. Whatever gets thrown at them, they persevere and they get stronger; they are a family. And they are as intense and inventive as ever."
  }
}
