{
  "type": "band",
  "name": "The Doors",
  "yearsActive": "1965-1973",
  "originCountry": "USA",
  "members": [
    "Jim Morrison",
    "John Densmore",
    "Ray Manzarek",
    "Robby Krieger"
  ],
  "pastMembers": [],
  "genres": [
    "Acid Rock",
    "Blues Rock",
    "Psychedelic Rock"
  ],
  "labels": [
    "Elektra Records"
  ],
  "bio": "The Doors were an American rock band formed in Los Angeles in 1965, with vocalist Jim Morrison, keyboardist Ray Manzarek, guitarist Robby Krieger, and drummer John Densmore. They were among the most controversial and influential rock acts of the 1960s, also because of Morrison's lyrics and voice along with his erratic stage persona, and the group was widely regarded as an important part of the era's counterculture.\n\nThe band took its name from the title of Aldous Huxley's book The Doors of Perception, itself a reference to a quote by William Blake. After signing with Elektra Records, the Doors with Morrison released six albums in five years, some of which are considered among the greatest of all time, including The Doors (1967), Strange Days (1967), and L.A. Woman (1971). They were one of the most successful bands during that time and by 1972 the Doors had sold over 4 million albums domestically and nearly 8 million singles.\n\nMorrison died in uncertain circumstances in 1971. The band continued as a trio until disbanding in 1973. They released three more albums in the 1970s, two of which featured earlier recordings by Morrison, and over the decades reunited on stage in various configurations. In 2002, Manzarek, Krieger and Ian Astbury of the Cult on vocals started performing as \"The Doors of the 21st Century\". Densmore and the Morrison estate successfully sued them over the use of the band's name. After a short time as Riders on the Storm, they settled on the name Manzarek–Krieger and toured until Manzarek's death in 2013.\n\nThe Doors were the first American band to accumulate eight consecutive gold LPs. According to the RIAA, they have sold 33 million records in the US and over 100 million records worldwide, making them one of the best-selling bands of all time. The Doors have been listed as one of the greatest artists of all time by magazines including Rolling Stone, which ranked them 41st on its list of the \"100 Greatest Artists of All Time\". In 1993, they were inducted into the Rock and Roll Hall of Fame.\n\nThe band took their name from the title of Aldous Huxley's book The Doors of Perception, itself derived from a line in William Blake's The Marriage of Heaven and Hell: \"If the doors of perception were cleansed, everything would appear to man as it is: infinite\".",
  "links": [{
    "type": "wikipedia",
    "url": "https://en.wikipedia.org/wiki/The_Doors"
  }, {
    "type": "discogs",
    "url": "https://www.discogs.com/artist/56798-The-Doors"
  }, {
    "type": "lastfm",
    "url": "https://www.last.fm/music/The+Doors"
  }],
  "testimony": {
    "from": "Marilyn Manson",
    "text": "Jim Morrison said it best: \"all the children are insane,\" and he meant it like I mean it. We are children revolted by the banality of what people think is sane. When Jim rambled, quite profoundly, \"Rock & roll is dead,\" and \"Hitler is still alive…. I slept with her last night,\" he knew then what we are choking on now. You can't change the world, and if you try, you just end up destroying it. We love all things to death. We leave the lights on, turn everything up to 10 and fuck everything we fear.\n\nIn 10th grade I was told to read No One Here Gets Out Alive, the biography of Jim Morrison. Everything I'm interested in now got started with that book. It made me want to be a writer, and I started with poetry and short stories. We don't know what was really going on in Morrison's head, but I liked trying to piece it together. The immortality of his words, the mystery of his existence appealed to my sense of fantasy. I found \"Moonlight Drive\" — particularly when accompanied by \"Horse Latitudes\" — scary and sexually mystifying, like Happy Days told by Ted Bundy. I read the poem in front of my 10th-grade English class, and it was as awe-inspiring then as it is now. Words like \"mute nostril agony\" and \"carefully refined and sealed over\" always stung in the corners of my eyes.\n\nI think the Doors still fit in because they never fit in in the first place. They didn't have a bass player. The music often had nothing to do with what Morrison was singing. The keyboard held everything together. Most bands can still get through a show if the keyboardist breaks a finger. Not the Doors. Robby Krieger played very odd guitar parts if you compare him to Jimmy Page or Keith Richards. Yet all this combined into something unique that grabbed people's attention.\n\nMorrison's voice was a beautiful pond for anything to drown in. Whatever he sang became as deep as he was. He had the unnameable thing that people will always be drawn to. I've always thought of the Doors as the first punk band, even more than the Stooges or the Ramones. They didn't sound anything like punk rock, but Morrison outshined everyone else when it came to rebellion and not playing by anyone else's rules. There are a lot of bands that seem to want to sound like the Doors filtered through grunge or neogrunge — or whatever it is. But it's all just ideas pasted on ideas, faded copies of copies. If you want to be like Jim Morrison, don't try. You can't be anything like Jim Morrison. It's about finding your own place in the world."
  }
}
